#include <iostream>

// 14 % 10 + 1 = 5 вариант
/*1. Написать программу SLAVE , которая выводит день недели по дате, переданной в качестве
параметра.Если параметр не передан, вывести об этом сообщение и закончить программу.
Если программа запущена из приложения MASTER, вывести на экран уникальный
идентификатор приложения MASTER Если программа запущена сама по себе, вывести об
этом информацию.
2. Написать приложение MASTER которое:
а) генерирует дату (день, месяц, год – 2000...2010), запускает приложение SLAVE и
передает в качестве параметров сгенерированную дату и уникальный идентификатор
процесса (MASTER). При завершении программы SLAVE завершается MASTER
3. Продемонстрировать совместную работу двух приложений. Для этого на экран должна
выводиться достаточно подробная информация о ходе выполнения каждого из процессов.
*/

int main()
{
    



    return 0;
}
